# CA2 Rory Sheridan

In [42]:
import pandas as pd

# Question 1
Read in the below information of a companyâ€™s transactions for the year2022 into a python dictionary files.

In [ ]:
class DataFrameManager:
    """Create dataframes from dictionaries and provide manage options."""

    # a. Convert each database into a dataframe in python.
    def __init__(self, *args: dict[str, list]) -> None:
        """Accept dictionaries and store as attributes."""
        for i, db_dict in enumerate(args):
            data_frame = pd.DataFrame(db_dict)
            setattr(self, f'dict_df_{i + 1}', data_frame)

    def clean_headings(self) -> None:
        """Remove the final s from the dataframe column names."""
        for value in vars(self).values():
            new_columns = [col.removesuffix('s') for col in value.columns]
            value.columns = new_columns

In [44]:
# Declare data.
dbase1_dict = {
    'TR_ID': [
        'C23',
        'C24',
        'C25',
        'C26',
        'C27',
        'C28',
    ],
    'Product': [
        'Telephone',
        'Monitors',
        'Car',
        'Rent',
        'Services',
        'Training',
    ],
    'Quantitys': [
        420,
        'Ten',
        234,
        114,
        56,
        13,
    ],
    'Purchase_prices': [
        223,
        344,
        223,
        'Tenn',
        'Two',
        223,
    ],
}
dbase2_dict = {
    'TR_ID': [
        'C23',
        'C24',
        'C25',
        'C26',
        'C27',
        'C28',
    ],
    'Products': [
        'Telephone',
        'Monitors',
        'Car',
        'Rent',
        'Services',
        'Training',
    ],
    'Sale_price': [
        300,
        435,
        329,
        544,
        'thirty',
        329,
    ],
    'Debit': [
        2,
        2,
        2,
        2,
        2,
        2,
    ],
}

dbase3_dict = {
    'TR_ID': ['C28'],
    'Product': ['Training'],
    'Quantity': [13],
    'Purchase_price': [223],
    'Sale_price': [329],
}

## a. Convert each database into a dataframe in python.

In [45]:
# Accepts dictionaries and stores the data frames as attributes.
dict_df_db = DataFrameManager(dbase1_dict, dbase2_dict, dbase3_dict)

dict_df_db.dict_df_1

  TR_ID    Product Quantitys Purchase_prices
0   C23  Telephone       420             223
1   C24   Monitors       Ten             344
2   C25        Car       234             223
3   C26       Rent       114            Tenn
4   C27   Services        56             Two
5   C28   Training        13             223

In [46]:
dict_df_db.dict_df_2

  TR_ID   Products Sale_price  Debit
0   C23  Telephone        300      2
1   C24   Monitors        435      2
2   C25        Car        329      2
3   C26       Rent        544      2
4   C27   Services     thirty      2
5   C28   Training        329      2

In [47]:
dict_df_db.dict_df_3

  TR_ID   Product  Quantity  Purchase_price  Sale_price
0   C28  Training        13             223         329

## b. Note that the databases and the corresponding column names withspelling differences. Correct this to have all column names without â€˜sâ€™

In [48]:
dict_df_db.clean_headings()

['TR_ID', 'Product', 'Quantity', 'Purchase_price']
['TR_ID', 'Product', 'Sale_price', 'Debit']
['TR_ID', 'Product', 'Quantity', 'Purchase_price', 'Sale_price']